saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Holtek.HT32_DFP.1.0.16.pdsc
        <device Dname="HT32F1253">
          <feature type="RTC"         n="32768"/>
          <memory     id="IROM1"                      start="0x00000000"  size="0x7C00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="32"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
      </subFamily>
    </family>

  <!-- ************************  Series 'HT32F165x'  **************************** -->
    <family Dfamily="HT32F16xx Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M3" DcoreVersion="r2p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
      <description>
The Holtek HT32F165x devices are high performance, low power consumption 32-bit microcontrollers based around an ARM Cortex-M3 processor core. The Cortex-M3 is a next-generation processor core which is tightly coupled with Nested Vectored Interrupt Controller (NVIC), SysTick timer, and includes advanced debug support.

The devices operate at a frequency of up to 72 MHz with a Flash accelerator to obtain maximum efficiency. They provide up to 256 KB of embedded Flash memory for code/data storage and 32 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as ADC, I2C, USART, UART, SPI, I2S, PDMA, GPTM, MCTM, SCI, EBI, CRC- 16/32, USB2.0 FS, SW-DP (Serial Wire Debug Port), etc., are also implemented in the devices. Several power saving modes provide the flexibility for maximum optimisation between wakeup latency and power consumption, an especially important consideration in low power applications.

The above features ensure that the devices are suitable for use in a wide range of applications, especially in areas such as white goods application control, power monitors, alarm systems, consumer products, handheld equipment, data logging applications, motor control, fingerprint recognition and so on.
      </description>
      <subFamily DsubFamily="HT32F1653/1654">
        <compile    header="ARM/INC/Holtek/HT32F1xxxx/ht32f1xxxx_01.h"/>
        <compile    define="USE_HT32F1653_54"/>
        <debug      svd="SVD/HT32F1653_54.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.70"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="8"                               name="Peripheral DMA"/>
        <feature type="ADC"         n="12"          m="12"/>
        <feature type="AnalogOther" n="2"                               name="Comparator"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="2"           m="16"              name="MCTM with Complementary Outputs"/>
        <feature type="WDT"         n="1"/>
        <feature type="ComOther"    n="1"                               name="SCI"/>
        <feature type="USBD"        n="1"/>
        <feature type="ExtBus"      n="16"                              name="EBI"/>
        <feature type="I2S"         n="1"/>
        <feature type="USART"       n="2"/>
        <feature type="UART"        n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="2"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <device Dname="HT32F1653">
          <!--<compile    define="USE_MEM_HT32F1653"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F1653_48LQFP">
          <!--<compile    define="USE_MEM_HT32F1653"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F1653_64LQFP">
          <!--<compile    define="USE_MEM_HT32F1653"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F1654">
          <!--<compile    define="USE_MEM_HT32F1654"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F1654_48LQFP">
          <!--<compile    define="USE_MEM_HT32F1654"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
