saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Holtek.HT32_DFP.1.0.16.pdsc
        <device Dname="HT32F52231_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F52241">
          <!--<compile    define="USE_MEM_HT32F52241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="SOP" n="24" name="24SSOP"/>
          <feature type="SOP" n="28" name="28SSOP"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
        </device>
        <device Dname="HT32F52241_24SSOP">
          <!--<compile    define="USE_MEM_HT32F52241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="19"/>
          <feature type="SOP" n="24" name="SSOP"/>
        </device>
        <device Dname="HT32F52241_28SSOP">
          <!--<compile    define="USE_MEM_HT32F52241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="23"/>
          <feature type="SOP" n="28" name="SSOP"/>
        </device>
        <device Dname="HT32F52241_33QFN">
          <!--<compile    define="USE_MEM_HT32F52241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="26"/>
          <feature type="QFN" n="33" name="QFN"/>
        </device>
        <device Dname="HT32F52241_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52241"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
      </subFamily>

      <subFamily DsubFamily="HT32F52243/52253">
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F52243_53"/>
        <debug      svd="SVD/HT32F52243_53.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.00"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="6"                               name="Peripheral DMA"/>
        <feature type="ADC"         n="12"          m="12"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="4"           m="16"              name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="1"           m="16"              name="MCTM with Complementary Outputs"/>
        <feature type="WDT"         n="1"/>
        <feature type="USART"       n="2"/>
        <feature type="UART"        n="4"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="3"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <device Dname="HT32F52243">
          <!--<compile    define="USE_MEM_HT32F52243"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="52"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F52243_33QFN">
          <!--<compile    define="USE_MEM_HT32F52243"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="26"/>
          <feature type="QFN" n="33" name="QFN"/>
        </device>
        <device Dname="HT32F52243_46QFN">
          <!--<compile    define="USE_MEM_HT32F52243"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="38"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
        <device Dname="HT32F52243_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52243"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F52243_64LQFP">
          <!--<compile    define="USE_MEM_HT32F52243"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="52"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
