saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Holtek.HT32_DFP.1.0.16.pdsc
        <device Dname="HT32F50220_28SOP">
          <!--<compile    define="USE_MEM_HT32F50220"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="22"/>
          <feature type="SOP"  n="28" name="SOP"/>
        </device>
        <device Dname="HT32F50220_33QFN">
          <!--<compile    define="USE_MEM_HT32F50220"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="26"/>
          <feature type="QFN"  n="33" name="QFN"/>
        </device>
        <device Dname="HT32F50220_44LQFP">
          <!--<compile    define="USE_MEM_HT32F50220"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="36"/>
          <feature type="QFP"  n="44" name="LQFP"/>
        </device>
        <device Dname="HT32F50220_48LQFP">
          <!--<compile    define="USE_MEM_HT32F50220"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="40"/>
          <feature type="QFP"  n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F50230">
          <!--<compile    define="USE_MEM_HT32F50230"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="SOP" n="24" name="24QFN"/>
          <feature type="SOP" n="24" name="24SSOP"/>
          <feature type="SOP" n="28" name="28SSOP"/>
          <feature type="SOP" n="28" name="28SOP"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFP" n="44" name="44LQFP"/>
          <feature type="QFP" n="48" name="48LQFP"/>
        </device>
        <device Dname="HT32F50230_24QFN">
          <!--<compile    define="USE_MEM_HT32F50230"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="18"/>
          <feature type="QFN" n="24" name="QFN"/>
        </device>
        <device Dname="HT32F50230_24SSOP">
          <!--<compile    define="USE_MEM_HT32F50230"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="19"/>
          <feature type="SOP" n="24" name="SSOP"/>
        </device>
        <device Dname="HT32F50230_28SSOP">
          <!--<compile    define="USE_MEM_HT32F50230"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="23"/>
          <feature type="SOP"  n="28" name="SSOP"/>
        </device>
        <device Dname="HT32F50230_28SOP">
          <!--<compile    define="USE_MEM_HT32F50230"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="22"/>
          <feature type="SOP"  n="28" name="SOP"/>
        </device>
        <device Dname="HT32F50230_33QFN">
          <!--<compile    define="USE_MEM_HT32F50230"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="26"/>
          <feature type="QFN"  n="33" name="QFN"/>
        </device>
        <device Dname="HT32F50230_44LQFP">
          <!--<compile    define="USE_MEM_HT32F50230"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="36"/>
          <feature type="QFP"  n="44" name="LQFP"/>
        </device>
        <device Dname="HT32F50230_48LQFP">
          <!--<compile    define="USE_MEM_HT32F50230"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs"  n="40"/>
          <feature type="QFP"  n="48" name="LQFP"/>
        </device>
      </subFamily>
      <subFamily DsubFamily="HT32F50231/50241">
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F50231_41"/>
        <debug      svd="SVD/HT32F50231_41.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="20000000"/>
        <feature type="IntRC"       n="20000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.50"        m="5.50"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="4"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="ADC"         n="12"          m="12"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="1"           m="16"              name="MCTM with Complementary Outputs"/>
        <feature type="WDT"         n="1"/>
        <feature type="USART"       n="1"/>
        <feature type="UART"        n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="2"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <device Dname="HT32F50231">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="40"/>
          <feature type="SOP" n="24" name="24QFN"/>
          <feature type="SOP" n="24" name="24SSOP"/>
          <feature type="SOP" n="28" name="28SSOP"/>
          <feature type="SOP" n="28" name="28SOP"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFP" n="44" name="44LQFP"/>
          <feature type="QFP" n="48" name="48LQFP"/>
        </device>
        <device Dname="HT32F50231_24QFN">
          <!--<compile    define="USE_MEM_HT32F50231"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x8000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="18"/>
          <feature type="QFN" n="24" name="QFN"/>
        </device>
